using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

/// Необходимо написать программу, которая будет принимать текст от пользователя и делать над ним определённые действия.
/// Функциональные требования:
/// *Программа принимает от пользователя минимум 100 символов
/// *Подсчёт количества слов в тексте
/// *Поиск самого короткого слова
/// *Подсчёт количества предложений
/// *Подсчёт количества гласных и согласных букв
/// *Поиск самого длинного слова
/// *Создание статистики по частоте встречаемости каждой буквы
/// *Возможность продолжить работу с новым текстом
/// *Сохранение всей статистики в список
/// *Возможность вывести статистику по прошлым текстам

namespace ISIP523_Bashlykova
{
    internal class Program
    {
        static void Main(string[] args)
        {
        }
    }
}
