using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace ISIP523_Bashlykova
{
    internal class Program
    {
        static void Main(string[] args)
        {
            /// Задание Учёт товаров в магазине
            /// У товара должны быть следующее параметры:
            /// * Уникальный код(начинается с "1", должен автоматически ставиться при пополнении списка товаров)
            /// * Название
            /// * Цена
            /// * Количество
            /// * Остался ли ещё товар на складе
            /// * Категория(выбирается из имеющихся, задаются в коде, сделайте как минимум 3)
           
            /// Мы можем работать с товаром через команды:
            /// * Добавить товар
            /// * Удалить товар
            /// * Заказать поставку товара
            /// * Продать товар
            /// * Поиск товаров(по коду, названию и категории).Необходимо выводить полную информацию о товаре.
        }
    }
}
